[
    {
        "name": "Abhik Mondal",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/35ebe6a7-812f-476e-6159-92e6852b6900/public",
        "comment": "I was married for 4 months and was very tense about the first night but Horse Fire Tablet made my marital life wonderful. She was in pain in the morning but was very happy with my performance. Thanks Horse Fire"
    },
    {
        "name": "Brijesh Soni",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/b99acc99-acce-49ca-a1af-861cf3210500/public",
        "comment": "Before taking Horsefire, my penis was loose and small, I used to ejaculate quickly but now I can have sex for hours and the result of this medicine in penis enlargement is in front of you."
    },
    {
        "name": "Umesh Panday",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/134ac53b-10f8-4fe3-479e-086d413f3400/public",
        "comment": "This medicine is very effective. After taking it, my energy, power, size and sex timing have increased a lot. Men with small penis and premature ejaculation should definitely use this medicine. Its result on penis is unbelievable, you can see it."
    },
    {
        "name": "Sanjay Rajbhar",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/35ebe6a7-812f-476e-6159-92e6852b6900/public",
        "comment": "I had the problem of premature ejaculation, the size was also less than I wanted. Then I took Horsefire tablet on the suggestion of my friend, it gave me tremendous benefits. My timing increased manifold and the change in penis size was also amazing in just 2 packs, now I can fuck any woman with this rod like penis."
    },
    {
        "name": "Sarvesh Kumar",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/8e2fc363-dbca-49d8-a6d1-cfeee4612600/public",
        "comment": "After taking Horse Fire Tablet my sex timing has improved a lot and I get stronger erections. Earlier my life partner was not happy with me but now she praises me and enjoys sex."
    },
    {
        "name": "Jitendra Jha ",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/04953bc6-23e0-4ddd-3b3c-3451206bd500/public",
        "comment": "Horse Fire Tablet is a real sex booster. It helps me to maintain stamina and erection for a long time sex... Also, my penis size increased which is amazing."
    },
    {
        "name": "Dinesh",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/a920bf8c-53fb-4ca9-b3ee-31f2d1c6ac00/public",
        "comment": "With work load and increasing age my sexual desire was decreasing, I was not getting sufficient erection in the penis and discharge happens very quickly but after taking this my desire has increased and sex lasts longer with hard erection."
    },
    {
        "name": "Shobhan",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/c3010de6-07ae-49f4-cce0-70bc6dee1900/public",
        "comment": "Earlier I was not able to feel it when I held it and the semen used to come out in 2-4 strokes but after taking Horsefire, my penis does not fit completely in my GF's hand and she starts moaning as soon as it enters. Horsefire Tablet is very effective."
    },
    {
        "name": "Chirag Panchal",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/70103b52-e81f-418b-ea48-950bd8583e00/public",
        "comment": "I have been taking this pill for 2 months. This wonderful pill has solved many of my sex problems...My stamina, enthusiasm, timing and penis size have increased a lot due to this Horsefire pill. These days the size has increased by more than 7 cm and the timing has increased by more than 25 minutes."
    },
    {
        "name": "Alok Rane",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/01f5e026-e716-4762-18ae-b2353a5edc00/public",
        "comment": "My penis was small earlier. Now it has become as I wanted. I am giving the before and after pics below, you can see. There has been a big change in the time duration of this as well!!"
    },
    {
        "name": "Vijay Kumar",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/16e8a163-6877-4f34-caa0-18ac92851400/public",
        "comment": "I had many GFs but I was not able to give pleasure to anyone. All of them broke up. Horsefire did wonders. This pill has improved my sex power and penis size a lot. Now my GF is completely satisfied with me."
    },
    {
        "name": "Satya Prakash",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/917e8c8e-f302-4346-0034-f7d77de6ab00/public",
        "comment": "Till now I have used many products...this is the best. In my opinion, this is the best formulation of Ayurveda especially for me. After using it for a few days, my stamina and timing increased. Horse Fire Tablet made my marital life happy."
    },
    {
        "name": "Prashant Damle",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/74bc971f-b035-452f-aaf6-7ed8c2db2f00/public",
        "comment": "This medicine really works. Or Pradhanane Mala, 45 years old Tarun Watley"
    },
    {
        "name": "Shyam Chaurasiya",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/dc09fec2-b2d1-4f4e-168b-54421ed8d700/public",
        "comment": "Yah waakai me kamaal ka ayurvedic stamina booster product hai, Iska koi comperesion nahi hai. Bilkul jaisa naam waisa kam hai iska gajab ki sex takt deta hai. Ab main pahle se kai guna jyada time tak enjoy kar paata hu."
    },
    {
        "name": "Ritu Juneja",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/d2700e1e-3209-4c92-f5ea-f9844dab9000/public",
        "comment": "This is best for men with short penish and lack of sex timing...jisse meri jaisi kitni sari females ko sex ka mja nhi mil paata hai..mere Husband ka penis kafi badh gya hai ab mujhe vo har bar thaka dete hai... mai har bar discharge ho jati hu par vo nhi hote hai. mujhe mja bahut milta hai...ab unka adha penis bhi orgasm de deta hai..."
    },
    {
        "name": "Nitesh Singh",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/48244b71-2f3d-441d-9f9b-2a40083d1d00/public",
        "comment": "Its results are amazing, I was getting treatment for a problem for years but there was no significant effect. It completely cured it in just 2 months. Heartfelt thanks to the person who made it"
    },
    {
        "name": "M. Amir",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/febde48d-b413-4109-da53-11394cc47700/public",
        "comment": "Very effective product...he feel's very energetic now"
    },
    {
        "name": "Vikash",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/7f024587-77a3-4218-b662-6a7364c76700/public",
        "comment": "Mujhe kmal ka result mila hai, iske istemal se ab meri timing kafi badh gyi hai...Part me hard erection milti hai jo jaldi dhila nhi padta hai."
    },
    {
        "name": "Shrikant Sharma",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/291fe6af-058e-49ef-30af-1f8a05e54800/public",
        "comment": "I used it regularly both times in the first 2 months but from the third month onwards I take one pill once or twice a day because my potency and timing have improved a lot. Thanks Horsefire for improving my sex life!!"
    }
]