[
    {
        "name": "Sashi roy",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/35ebe6a7-812f-476e-6159-92e6852b6900/public",
        "comment": "প্রথমে ধরলে তো বুঝতেই পারতাম না। ২-৪ ঝটকা মারলেই জল বেরিয়ে যেত। Horsefire খাওয়ার পরে আমার লিঙ্গটি আমার gf তার হাত দিয়ে পুরো ধরতে পারেনা এবং লিঙ্গটি ঢোকালেই সে চিৎকার করতে শুরু করে। Horsefire ট্যাবলেট সত্যিই খুব কার্যকর।"
    },
    {
        "name": "Papai ghorai",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/b99acc99-acce-49ca-a1af-861cf3210500/public",
        "comment": "Horsefire নেওয়ার আগে আমার লিঙ্গটি ঢিলে ঢালাও ছোট ছিল। স্পার্ম ও খুব তাড়াতাড়ি বেরিয়ে যেতো, কিন্তু এখন আমি ঘন্টার পর ঘন্টা সহবাস করি এবং লিঙ্গ বড় করার এই ওষুধটির ফলাফল তো আপনাদের সামনেই।"
    },
    {
        "name": "Sumit nath",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/134ac53b-10f8-4fe3-479e-086d413f3400/public",
        "comment": "Yah dwa bahut asardar hai ise khane ke bad mera josh, power, size aur sex timing kafi bad gya hai...chhote ling aur jaldi jhad jane wale mardo ko is dwa ka upyog jarur krna chahiye. Ling par iska result unbelievable hai, aap dekh sakte hai."
    },
    {
        "name": "Rahul debnath",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/35ebe6a7-812f-476e-6159-92e6852b6900/public",
        "comment": "আমার শীঘ্রপতনের সমস্যা ছিল। এবং আমার সাইজও যেরকম আমি চাইছিলাম সেরকম ছিল না। একদিন আমি একটা বন্ধুর পরামর্শতে হর্সফায়ার ট্যাবলেট খাই।এটি খেয়ে আমি খুব ভালো লাভ পাই। আমার টাইমিং অনেক বেড়ে যায় এবং মাত্র ২টি প্যাকেই আমার সাইজ আশ্চর্যজনকভাবে বদলে যায়। এখন আমি আমার এই রডের মতো লিঙ্গটি দিয়ে যেকোনো মহিলাকে ঠুকে ঠান্ডা করে দিতে পারি।"
    },
    {
        "name": "Rohit das",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/70103b52-e81f-418b-ea48-950bd8583e00/public",
        "comment": "Main 2 mahine se is goli ko kha rha hu. Is adbhut goli ne meri kai sex problems ko mita diya...Is Horsefire ki goli se mera stamina, josh, timing aur penis size kafi jyada badhh gya hai..in dino me 7 cm se jyada size 25 minute se jyada timing badha hai."
    },
    {
        "name": "Ajoy dey",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/01f5e026-e716-4762-18ae-b2353a5edc00/public",
        "comment": "আমার লিঙ্গ আগে অনেক ছোট ছিল। এখন আমি যেমন চেয়েছিলাম তেমনটাই হয়েছে।আমি নিচে আগের এবং এখনকার ছবি দিচ্ছি। আপনারা দেখতে পারেন। এমনকি আমার সেক্স টাইমিং এ বড় ধরনের পরিবর্তন এসেছে।"
    },
    {
        "name": "Sanchay banerjee",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/16e8a163-6877-4f34-caa0-18ac92851400/public",
        "comment": "আমার অনেক gf ছিল কিন্তু কাউকে আনন্দ দিতে পারিনি। সবাই ব্রেকআপ করে চলে গেছে। হর্সফায়ার বিস্ময়কর কাজ করেছে। আমার যৌন ক্ষমতা এবং লিঙ্গের আকার দুটোরই উন্নতি হয়েছে এবং এখন আমার gf আমার প্রতি সম্পূর্ণরূপে সন্তুষ্ট।"
    },
    {
        "name": "Sourav das",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/917e8c8e-f302-4346-0034-f7d77de6ab00/public",
        "comment": "Abhi tak mai kai product use kar chuka hu...ye sabse a6aa hai. mere vichar se khaskar mere liye ye ayurved ka best formulation hai. Iska kuchh hi din use krne ke bad meri stamina aur timing increase ho gyi. Horse Fire Tablet ne meri marital life ko khushahal bna diya."
    },
    {
        "name": "Akhyay pal",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/74bc971f-b035-452f-aaf6-7ed8c2db2f00/public",
        "comment": "এই ওষুধটি সত্যিই কাজ করে। এই ওষুধটি আমাকে 45 বছর বয়সে যুবক হবার অনুভূতি দিয়েছে।"
    },
    {
        "name": "Santanu naskar",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/dc09fec2-b2d1-4f4e-168b-54421ed8d700/public",
        "comment": "Yah waakai me kamaal ka ayurvedic stamina booster product hai, Iska koi comperesion nahi hai. Bilkul jaisa naam waisa kam hai iska gajab ki sex takt deta hai. Ab main pahle se kai guna jyada time tak enjoy kar paata hu."
    },
    {
        "name": "Shikha Chaugale",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/d2700e1e-3209-4c92-f5ea-f9844dab9000/public",
        "comment": "This is best for men with short penish and lack of sex timing...jisse meri jaisi kitni sari females ko sex ka mja nhi mil paata hai..mere Husband ka penis kafi badh gya hai ab mujhe vo har bar thaka dete hai... mai har bar discharge ho jati hu par vo nhi hote hai. mujhe mja bahut milta hai...ab unka adha penis bhi orgasm de deta hai..."
    },
    {
        "name": "Avishek basak",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/48244b71-2f3d-441d-9f9b-2a40083d1d00/public",
        "comment": "এর ফলাফল খুবই ভালো। যে সমস্যার জন্য আমি বছরের পর বছর চিকিৎসা করিয়ে যাচ্ছিলাম এবং সেই চিকিৎসার কোন ফল মিল ছিল না। এই ওষুধটি মাত্র 2 মাসের মধ্যে আমার রোগকে গোঁড়া থেকে শেষ করে দেয়। এই ওষুধটি যে বানিয়েছে তাকে আন্তরিক ধন্যবাদ।"
    },
    {
        "name": "Rupayan banerjee",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/febde48d-b413-4109-da53-11394cc47700/public",
        "comment": "Very effective product...he feel's very energetic now"
    },
    {
        "name": "Vikash",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/7f024587-77a3-4218-b662-6a7364c76700/public",
        "comment": "Mujhe kmal ka result mila hai, iske istemal se ab meri timing kafi badh gyi hai...Part me hard erection milti hai jo jaldi dhila nhi padta hai."
    },
    {
        "name": "Subho sardar",
        "profile_photo": "https://imagedelivery.net/aacnHGAqlUDhaplA3bnkbA/291fe6af-058e-49ef-30af-1f8a05e54800/public",
        "comment": "প্রথম 2 মাস, আমি নিয়মিত উভয়ের সময় ওষুধটি খেয়েছি। তৃতীয় মাস থেকে আমি একদিন বা দুইদিনে একটি করে পিল খেতাম কারণ আমার ক্ষমতা এবং টাইমিং দুটোই অনেক বেড়ে গেছিল। আমার যৌন জীবন উন্নত করার জন্য হর্সফায়ারকে ধন্যবাদ।"
    }
]